Revit 2027 API
ParameterTypeId.StairsTotalNumberOfRisers Property
 "Total Number of Risers": Total number of risers
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsTotalNumberOfRisers { get; }
Public Shared ReadOnly Property StairsTotalNumberOfRisers As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsTotalNumberOfRisers {
	ForgeTypeId^ get ();
}
static member StairsTotalNumberOfRisers : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace